/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/parts/debug/browser/repl.nls.ru", {
	"vs/workbench/parts/debug/browser/repl": [
		"Панель цикла чтение-вычисление-печать",
	],
	"vs/workbench/parts/debug/browser/replViewer": [
		"Состояние объекта записывается после первого вычисления",
		"Щелкните, чтобы отслеживать (чтобы открыть сбоку экрана, щелкните, удерживая клавишу CMD)",
		"Щелкните, чтобы отслеживать (чтобы открыть сбоку экрана, щелкните, удерживая клавишу CTRL)",
		"Переменная {0} имеет значение {1}, цикл чтение-вычисление-печать, отладка",
		"Выражение {0} имеет значение {1}, цикл чтение-вычисление-печать, отладка",
		"{0}, цикл чтение-вычисление-печать, отладка",
		"Выходная переменная {0} имеет значение {1}, цикл чтение-вычисление-печать, отладка",
	]
});