/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/node/extensionHostProcess.nls.ru", {
	"vs/base/common/processes": [
		"Ошибка: в исполняемых данных должна определяться команда типа string.",
		"Предупреждение: isShellCommand должен иметь тип boolean. Игнорируется значение {0}.",
		"Предупреждение: аргументы должны иметь тип string[]. Игнорируется значение {0}.",
		"Предупреждение: options.cwd должен иметь тип string. Игнорируется значение {0}.",
	],
	"vs/base/common/severity": [
		"Ошибка",
		"Предупреждение",
		"Сведения",
	],
	"vs/base/node/processes": [
		"Невозможно выполнить команду оболочки на диске UNC.",
	],
	"vs/platform/extensions/common/abstractExtensionService": [
		"Не удалось активировать расширение \"{1}\". Причина: неизвестный зависимый компонент \"{0}\".",
		"Не удалось активировать расширение \"{1}\". Причина: ошибка активации зависимого компонента \"{0}\".",
		"Не удалось активировать расширение \"{0}\". Причина: более 10 уровней зависимостей (скорее всего, цикл зависимостей).",
		"Ошибка активации расширения \"{0}\": {1}.",
	],
	"vs/platform/extensions/common/extensionsRegistry": [
		"Для расширений VS Code указывает версию VS Code, с которой совместимо расширение. Она не может быть задана как \"*\". Например, ^0.10.5 сообщает о совместимости с минимальной версией VS Code 0.10.5.",
		"Издатель расширения VS Code.",
		"Отображаемое имя расширения, используемого в коллекции VS Code.",
		"Категории, используемые коллекцией VS Code для классификации расширения.",
		"Баннер, используемый в магазине VS Code.",
		"Цвет баннера в заголовке страницы магазина VS Code.",
		"Цветовая тема для шрифта, используемого в баннере.",
		"Все публикации расширения VS Code, представленные этим пакетом.",
		"Добавляет метку \"Предварительная версия\" для расширения в Marketplace.",
		"События активации для расширения кода VS Code.",
		"Массив эмблем, отображаемых на боковой панели страницы расширения Marketplace.",
		"URL-адрес изображения эмблемы.",
		"Ссылка на эмблему.",
		"Описание эмблемы.",
		"Зависимости от других расширений. Идентификатор расширения — всегда ${publisher}.${name}. Например: vscode.csharp.",
		"Скрипт, выполняемый перед публикацией пакета в качестве расширения VS Code.",
		"Путь к значку размером 128 x 128 пикселей.",
	],
	"vs/workbench/api/node/extHostDiagnostics": [
		"Не отображается еще несколько ошибок и предупреждений ({0}).",
	],
	"vs/workbench/node/extensionHostMain": [
		"Путь \"{0}\" не указывает на допустимый модуль выполнения тестов расширения.",
	]
});