/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/parts/search/browser/searchViewlet.nls.ru", {
	"vs/workbench/parts/search/browser/patternInputWidget": [
		"ввод",
		"Использовать стандартные маски",
		"Шаблон для сопоставления. Например, ****/*.js** соответствует всем файлам JavaScript, а **myFolder/**** соответствует этой папке со всеми дочерними элементами.\n\n**Ссылка**:\n***** соответствует 0 или более символов\n**?** соответствует 1 символу\n****** соответствует 0 или более каталогов\n**[a-z]** соответствует диапазону символов\n**{a,b}** соответствует любому из шаблонов",
	],
	"vs/workbench/parts/search/browser/searchResultsView": [
		"Найдено соответствий: {0}",
		"Найдено соответствие: {0}",
		"Совпадений в файле {1} папки {2}: {0}, результат поиска",
		"Результаты предварительного просмотра замены, {0}",
		"{0}, результат поиска",
	],
	"vs/workbench/parts/search/browser/searchViewlet": [
		"Переключить сведения о поиске",
		"включаемые файлы",
		"Шаблоны включения в поиск",
		"исключаемые файлы",
		"Шаблоны исключения из поиска",
		"файлы, исключенные в параметрах",
		"Настроенные шаблоны исключения из поиска",
		"Replaced {0} occurrences across {1} files with {2}.",
		"Removed {0} occurrences across {1} files.",
		"Заменить все",
		"Replace {0} occurrences across {1} files with \'{2}\'?",
		"Remove {0} occurrences across {1} files?",
		"Заменить",
		"Результаты поиска",
		"{0}, когда {1}",
		"Результирующий набор включает только подмножество всех соответствий. Чтобы уменьшить число результатов, сузьте условия поиска.",
		"Поиск был отменен до того, как были найдены какие-либо результаты — ",
		"Не найдено результатов в \"{0}\", исключая \"{1}\", — ",
		"Результаты в \"{0}\" не найдены — ",
		"Результаты не найдены за исключением \"{0}\" — ",
		"Результаты не найдены. Проверьте параметры настроенных исключений — ",
		"Выполнить поиск еще раз",
		"Выполните поиск во всех файлах",
		"Открыть параметры",
		"Поиск вернул результатов: {0} в файлах: {1}",
	]
});