/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/parts/search/browser/searchViewlet.nls.ko", {
	"vs/workbench/parts/search/browser/patternInputWidget": [
		"입력",
		"Glob 패턴 사용",
		"일치 패턴입니다. 예: ****/*.js** - 모든 JavaScript 파일을 일치시킵니다. **myFolder/**** - 해당 폴더와 모든 자식을 일치시킵니다.\n\n**참조**:\n*****은 0개 이상의 문자를 일치시킵니다.\n**?**은 1개의 문자를 일치시킵니다.\n******은 0개 이상의 디렉터리를 일치시킵니다.\n**[a-z]**는 문자 범위를 일치시킵니다.\n**{a,b}**는 패턴을 일치시킵니다.",
	],
	"vs/workbench/parts/search/browser/searchResultsView": [
		"일치하는 {0}개 항목을 찾음",
		"일치하는 {0}개 항목을 찾음",
		"{2} 폴더의 {1} 파일에 {0}개의 일치 항목이 있음, 검색 결과",
		"미리 보기 바꾸기 결과, {0}",
		"{0}, 검색 결과",
	],
	"vs/workbench/parts/search/browser/searchViewlet": [
		"검색 세부 정보 설정/해제",
		"포함할 파일",
		"패턴 포함 검색",
		"제외할 파일",
		"패턴 제외 검색",
		"설정을 통해 제외된 파일",
		"구성된 검색 제외 패턴",
		"{1}개 파일에서 {0}개를 바꿨습니다.",
		"Removed {0} occurrences across {1} files.",
		"모두 바꾸기",
		"{1}개 파일에서 {0}개를 바꿀까요?",
		"Remove {0} occurrences across {1} files?",
		"바꾸기",
		"검색 결과",
		"{0}({1}인 경우)",
		"결과 집합에는 모든 일치 항목의 하위 집합만 포함됩니다. 결과 범위를 좁히려면 검색을 더 세분화하세요.",
		"결과를 찾기 이전에 검색이 취소되었습니다. -",
		"\'{0}\'에 \'{1}\'을(를) 제외한 결과 없음 - ",
		"\'{0}\'에 결과 없음 - ",
		"\'{0}\'을(를) 제외하는 결과가 없음 - ",
		"결과가 없습니다. 구성된 확장에 대한 설정을 검토하세요. - ",
		"다시 검색",
		"모든 파일에서 다시 검색",
		"설정 열기",
		"검색에서 {1}개의 파일에 {0}개의 결과를 반환했습니다.",
	]
});