/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/parts/search/browser/searchViewlet.nls.ja", {
	"vs/workbench/parts/search/browser/patternInputWidget": [
		"入力",
		"glob パターンを使用する",
		"一致するパターン。たとえば、****/*.js** はすべての JavaScript ファイルと一致し、**myFolder/**** は当該フォルダーとすべての子と一致します。\n\n**参照情報**:\n***** は 0 個以上の文字と一致します\n**?** は 1 文字と一致します\n****** は 0 個以上のディレクトリと一致します\n**[a-z]** は文字の範囲と一致します\n**{a,b}** は任意のパターンと一致します)",
	],
	"vs/workbench/parts/search/browser/searchResultsView": [
		"一致する項目が {0} 件見つかりました",
		"一致する項目が {0} 件見つかりました",
		"フォルダー {2} のファイル {1} 内で {0} 件の一致、検索結果",
		"プレビュー結果の置換、{0}",
		"{0}、検索結果",
	],
	"vs/workbench/parts/search/browser/searchViewlet": [
		"詳細検索の切り替え",
		"含めるファイル",
		"検索包含パターン",
		"除外するファイル",
		"検索除外パターン",
		"設定で除外されたファイル",
		"検索除外パターンを構成しました",
		"{1} ファイルで {0} 件の出現箇所を置換しました。",
		"Removed {0} occurrences across {1} files.",
		"すべて置換",
		"{1} ファイルで {0} 件の出現箇所を置換しますか?",
		"Remove {0} occurrences across {1} files?",
		"置換",
		"検索結果",
		"{1} のとき {0}",
		"結果セットにはすべての一致項目のサブセットのみが含まれています。より限定的な検索条件を入力して、検索結果を絞り込んでください。",
		"結果が見つかる前に検索が取り消されました - ",
		"\'{0}\' に \'{1}\' を除外した結果はありません - ",
		"\'{0}\' に結果はありません - ",
		"\'{0}\' を除外した結果はありませんでした - ",
		"結果はありません。構成された除外の設定を確認してください - ",
		"もう一度検索してください",
		"すべてのファイルでもう一度検索してください",
		"設定を開く",
		"検索により {1} 個のファイル内の {0} 件の結果が返されました",
	]
});