/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/parts/debug/node/telemetryApp.nls.ru", {
	"vs/base/common/processes": [
		"Ошибка: в исполняемых данных должна определяться команда типа string.",
		"Предупреждение: isShellCommand должен иметь тип boolean. Игнорируется значение {0}.",
		"Предупреждение: аргументы должны иметь тип string[]. Игнорируется значение {0}.",
		"Предупреждение: options.cwd должен иметь тип string. Игнорируется значение {0}.",
	],
	"vs/base/node/processes": [
		"Невозможно выполнить команду оболочки на диске UNC.",
	]
});